_posts/lisp/sicp/2020-08-23-sicp-ps1.1.html
---
layout: post
title: SICP Problem Set 1.1
---

<script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML" type="text/javascript"></script>

<p>
<i>Problems from SICP &sect;1.1</i>
</p>

<div id="outline-container-org6742938" class="outline-2">
<h2 id="org6742938"><span class="section-number-2">1</span> Exercise 1.1</h2>
<div class="outline-text-2" id="text-1">
<p>
What is the result of the following expressions?
</p>

<div class="org-src-container">
<pre class="src src-scheme">10                 <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">10</span>
<span style="color: #4f97d7;">(</span>+ 5 3 4<span style="color: #4f97d7;">)</span>          <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">12</span>
<span style="color: #4f97d7;">(</span>- 9 1<span style="color: #4f97d7;">)</span>            <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">8</span>
<span style="color: #4f97d7;">(</span>/ 6 2<span style="color: #4f97d7;">)</span>            <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">3</span>
<span style="color: #4f97d7;">(</span>+ <span style="color: #bc6ec5;">(</span>* 2 4<span style="color: #bc6ec5;">)</span>
   <span style="color: #bc6ec5;">(</span>- 4 6<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>        <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">6</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5; font-weight: bold;">a</span> 3<span style="color: #4f97d7;">)</span>       <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">A</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5; font-weight: bold;">b</span> <span style="color: #bc6ec5;">(</span>+ a 1<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">B</span>
<span style="color: #4f97d7;">(</span>+ a b <span style="color: #bc6ec5;">(</span>* a b<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">19</span>
<span style="color: #4f97d7;">(</span>= a b<span style="color: #4f97d7;">)</span>            <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">#f</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #2d9574;">(</span>&gt; b a<span style="color: #2d9574;">)</span>
         <span style="color: #2d9574;">(</span>&lt; b <span style="color: #67b11d;">(</span>* a b<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
    b
    a<span style="color: #4f97d7;">)</span>             <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">4</span>
<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">cond</span> <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>= a 4<span style="color: #2d9574;">)</span>
       6<span style="color: #bc6ec5;">)</span>
      <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span>= b 4<span style="color: #2d9574;">)</span>
       <span style="color: #2d9574;">(</span>+ 6 7 a<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
      <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">else</span>
       25<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>        <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">16</span>
<span style="color: #4f97d7;">(</span>+ 2
   <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>&gt; b a<span style="color: #2d9574;">)</span>
       b
       a<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>         <span style="color: #2aa1ae; background-color: #292e34;">;;  </span><span style="color: #2aa1ae; background-color: #292e34;">6</span>
<span style="color: #4f97d7;">(</span>* <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">cond</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>&gt; a b<span style="color: #67b11d;">)</span>
          a<span style="color: #2d9574;">)</span>
         <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span>&lt; a b<span style="color: #67b11d;">)</span>
          b<span style="color: #2d9574;">)</span>
         <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">else</span>
          -1<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
   <span style="color: #bc6ec5;">(</span>+ a 1<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>        <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">16</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd3d8fae" class="outline-2">
<h2 id="orgd3d8fae"><span class="section-number-2">2</span> Exercise 1.2</h2>
<div class="outline-text-2" id="text-2">
<p>
Translate the expression
</p>
\begin{equation}
  \frac{5 + 4 + \left( 2 - \left( 3 - \left( 6 + 4/5 \right) \right) \right)}{3 \left( 6 - 2 \right)
    \left( 2 - 7 \right)}
\end{equation}
<p>
into prefix form.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">(</span>/ <span style="color: #bc6ec5;">(</span>+ 5
      4
      <span style="color: #2d9574;">(</span>- 2 <span style="color: #67b11d;">(</span>- 3 <span style="color: #b1951d;">(</span>+ 6 <span style="color: #4f97d7;">(</span>/ 4 5<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
   <span style="color: #bc6ec5;">(</span>* 3
      <span style="color: #2d9574;">(</span>- 6 2<span style="color: #2d9574;">)</span>
      <span style="color: #2d9574;">(</span>- 2 7<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org388580d" class="outline-2">
<h2 id="org388580d"><span class="section-number-2">3</span> Exercise 1.3</h2>
<div class="outline-text-2" id="text-3">
<p>
Define a procedure that takes three numbers as arguments and returns the sum of squares of the
larger two.
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">ex1.3</span> a b c<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">cond</span>
   <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #b1951d;">(</span>&gt;= a b<span style="color: #b1951d;">)</span>
         <span style="color: #b1951d;">(</span>&gt;= b c<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
    <span style="color: #67b11d;">(</span>sum-of-squares a b<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span><span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">and</span> <span style="color: #b1951d;">(</span>&gt;= b c<span style="color: #b1951d;">)</span>
         <span style="color: #b1951d;">(</span>&gt;= c a<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
    <span style="color: #67b11d;">(</span>sum-of-squares b c<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">else</span>
    <span style="color: #67b11d;">(</span>sum-of-squares c a<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6fbf4e2" class="outline-2">
<h2 id="org6fbf4e2"><span class="section-number-2">4</span> Exercise 1.4</h2>
<div class="outline-text-2" id="text-4">
<p>
Describe the behaviour of
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">a-plus-abs-b</span> a b<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>&gt; b 0<span style="color: #67b11d;">)</span>
       +
       -<span style="color: #2d9574;">)</span>
   a
   b<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
The sign of <code>b</code> is checked by the <code>if</code> expression, returning a <code>+</code> or <code>-</code> for the operand of the body of
<code>a-plus-abs-b</code> as appropriate.
</p>
</div>
</div>

<div id="outline-container-orgf8c1832" class="outline-2">
<h2 id="orgf8c1832"><span class="section-number-2">5</span> Exercise 1.5</h2>
<div class="outline-text-2" id="text-5">
<p>
Given
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">p</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span>p<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">test</span> x y<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>= x 0<span style="color: #2d9574;">)</span>
      0
      y<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
what happens when evaluating <code>(test 0 (p))</code> using <i>applicative-order</i> evaluation?
</p>

<p>
The arguments are evaluated first resulting in an infinite loop of evaluating <code>(p)</code>.
</p>

<p>
Using <i>normal-order</i> evaluation the operands are not evaluated until required, as a result <code>(p)</code> is
never evaluated and the expression returns <code>0</code>.
</p>
</div>
</div>

<div id="outline-container-orgdd12a8e" class="outline-2">
<h2 id="orgdd12a8e"><span class="section-number-2">6</span> Exercise 1.6</h2>
<div class="outline-text-2" id="text-6">
<p>
Defining <code>if</code> as a procedure, rather than a special form, using <code>cond</code>
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">new-if</span> predicate then-clause else-clause<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">cond</span> <span style="color: #2d9574;">(</span>predicate then-clause<span style="color: #2d9574;">)</span>
        <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">else</span> else-clause<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
What happens when <code>sqrt-iter</code> is rewritten using <code>new-if</code>?
</p>

<p>
As <code>scheme</code> uses <i>applicative-order</i> evaluation the operands of <code>new-if</code> are evaluated <i>before</i> applying the
<code>new-if</code> procedure.
This will result in an infinite loop as <code>sqrt-iter</code> is itself an operand of <code>new-if</code> within the new
definition of <code>sqrt-iter</code>.
</p>
</div>
</div>

<div id="outline-container-orge7b09d0" class="outline-2">
<h2 id="orge7b09d0"><span class="section-number-2">7</span> Exercise 1.7</h2>
<div class="outline-text-2" id="text-7">
<p>
Computing the <code>sqrt</code> of small numbers with the given implementation of <code>good-enough?</code> will result in
significant errors as the difference between <code>x</code> and <code>(square guess)</code> can then be large relative to <code>x</code>
whilst still satisfying the absolute tolerance test, <i>e.g.</i> <code>(sqrt-block-struct 0.0001)</code> evaluates to
<code>0.032</code> a \(>200%\) error.
With large numbers however the test may never be satisfied, resulting in an infinite loop, as an
example <code>(sqrt-block-struct 12345678910111213141516)</code> never returns.
This occurs as <code>guess</code> approaches the solution <code>improve-guess</code> tends to an artificial fixed point which
does not satisfy the convergence test.
The artificial fixed point is due to finite precision
</p>
\begin{equation}
  \begin{split}
    y &= y \left( 1 + \varepsilon \right),\ \varepsilon \rightarrow 0 \\
    \Rightarrow y_{n+1} &= \frac{x/y_n + y_n}{2} \\
    &= \frac{y_n\left( 1 + \varepsilon \right) + y_n}{2} \\
    &= y_n ,\ \left| y^2_n - x \right| > tol \ .
  \end{split}
\end{equation}

<p>
As an alternative we can stop when the change in guess is a very small fraction of the previous
guess.
A <code>sqrt</code> procedure using this approach is implemented in listing&nbsp;<a href="#orgbc0d574">1</a>.
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>A better <code>sqrt</code> procedure using change in guess.</label><pre class="src src-scheme" id="orgbc0d574"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">sqrt</span> x<span style="color: #bc6ec5;">)</span>

  <span style="color: #2aa1ae; background-color: #292e34;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
  <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">sqrt iteration</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">sqrt-iter</span> guess prev-guess<span style="color: #2d9574;">)</span>

    <span style="color: #2aa1ae; background-color: #292e34;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Helper procedures</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">improve-guess</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span>/ <span style="color: #b1951d;">(</span>+ <span style="color: #4f97d7;">(</span>/ x guess<span style="color: #4f97d7;">)</span>
            guess<span style="color: #b1951d;">)</span>
         2<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">good-enough?</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span>&lt;= <span style="color: #b1951d;">(</span>abs <span style="color: #4f97d7;">(</span>- guess prev-guess<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>
         <span style="color: #b1951d;">(</span>* 0.001 guess<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>

    <span style="color: #2aa1ae; background-color: #292e34;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
    <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Procedure body</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>good-enough?<span style="color: #67b11d;">)</span>
        guess
        <span style="color: #67b11d;">(</span>sqrt-iter <span style="color: #b1951d;">(</span>improve-guess<span style="color: #b1951d;">)</span> guess<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>

  <span style="color: #2aa1ae; background-color: #292e34;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>
  <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Set the iteration going</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #2d9574;">(</span>= x 0<span style="color: #2d9574;">)</span>
      0 <span style="color: #2aa1ae; background-color: #292e34;">;; </span><span style="color: #2aa1ae; background-color: #292e34;">Special case when x is zero</span>
      <span style="color: #2d9574;">(</span>sqrt-iter 1.0 1.1<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span>Testing the improved <code>sqrt</code> procedure on a small number.</label><pre class="src src-scheme" id="org3a3979a"><span style="color: #ce537a; font-weight: bold;">&lt;&lt;src:better-sqrt&gt;&gt;</span>
<span style="color: #4f97d7;">(</span>sqrt 0.0001<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
0.010000000025490743

</pre>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span>Testing the improved <code>sqrt</code> procedure on a large number.</label><pre class="src src-scheme" id="orgf444c9a"><span style="color: #ce537a; font-weight: bold;">&lt;&lt;src:better-sqrt&gt;&gt;</span>
<span style="color: #4f97d7;">(</span>sqrt 12345678910111213141516<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
111111111215.4397

</pre>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 4: </span>Testing the improved <code>sqrt</code> procedure on zero.</label><pre class="src src-scheme" id="org0a1e3f0"><span style="color: #ce537a; font-weight: bold;">&lt;&lt;src:better-sqrt&gt;&gt;</span>
<span style="color: #4f97d7;">(</span>sqrt 0<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
0

</pre>
</div>
</div>

<div id="outline-container-org3a7fd06" class="outline-2">
<h2 id="org3a7fd06"><span class="section-number-2">8</span> Exercise 1.8</h2>
<div class="outline-text-2" id="text-8">
<p>
Applying Newton&rsquo;s method to calculate the cube root of \(x\) yields an update of the form
</p>
\begin{equation}
  y_{n+1} = \frac{x/y^2_n + 2y_n}{3} \ .
\end{equation}

<p>
A cube root procedure can be implemented analogously to the <code>sqrt</code> procedure as
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">cube-root</span> x<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #2d9574;">(</span><span style="color: #bc6ec5; font-weight: bold;">try</span> guess prev-guess absx<span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">good-enough?</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span>&lt; <span style="color: #b1951d;">(</span>abs <span style="color: #4f97d7;">(</span>- guess prev-guess<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>
         <span style="color: #b1951d;">(</span>* 0.001 guess<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #67b11d;">(</span><span style="color: #bc6ec5; font-weight: bold;">improve</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span>/ <span style="color: #b1951d;">(</span>+ <span style="color: #4f97d7;">(</span>/ absx <span style="color: #bc6ec5;">(</span>* guess guess<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
            <span style="color: #4f97d7;">(</span>* 2 guess<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span>
         3<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>good-enough?<span style="color: #67b11d;">)</span>
        guess
        <span style="color: #67b11d;">(</span>try <span style="color: #b1951d;">(</span>improve<span style="color: #b1951d;">)</span> guess absx<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #67b11d;">(</span>&gt; x 0<span style="color: #67b11d;">)</span>
       +
       -<span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>try 1.0 1.1 <span style="color: #67b11d;">(</span>abs x<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
The above implementation use of the fact that \(x^3 = sign\left(x\right)\left|x\right|^3\) to avoid
potential numerical issues as the value of <code>guess</code> crosses zero.
</p>
</div>
</div>
